{"title":"eggramen updates","url":"https://eggramen.neocities.org/log.html","favicon":"https://eggramen.neocities.org/favicon.ico","elements":[{"contents":"<li>Revamped the \"fake wp 2\" style and added two alternate skins.</li>\n    <li>Added bonus joke text to a secret for make it funnier and more accurate.</li>","retrieved":1635399731357},{"contents":"<li>Commented more of the testpage code.</li>\n    <li>Added fonts for two other conlangs! Ewa Sio is planned to have a writing system that wouldn't work with normal fonts, though, so I'll probably stick to images for that one.</li>","retrieved":1635399731357},{"contents":"<li>Fixed a broken font on my Golden Sun stylesheet.</li>\n    <li>Reorganized Naūkeman page.</li>\n    <li>Found some code for a dropdown CSS changer.</li>","retrieved":1635399731357},{"contents":"<li>Began working on updating and running through site to-do list.</li>\n    <li>Finally replaced the placeholder favicon! I've been using a random test image for ages, so it's nice to finally fix that. (Goodbye, mystery lava blob!)</li>\n    <li>Added more words to languages, including Alternian (which has been sorely overdue a set of proper color words.)</li>","retrieved":1635399731357},{"contents":"<li>Added another set of 88x31 buttons for the Neocities IDE/Code Editor, because I thought it was funny.</li>\n    <li>Started adding better commenting/documentation for CSS stylesheets, especially the free-use layouts.</li>\n    <li>Miscellanous edits.</li>","retrieved":1635399731357},{"contents":"<li>Started messing around with javascript, because I can. It probably won't see any significant use.</li>\n    <li>Added more content to multiple conlangs.</li>\n    <li>Added several new 88x31 buttons to the <a href=\"/edits/buttons.html\">homemade buttons</a> page, including several versions of an \"I Surivived the Tumblr Apocalypse\" button I'm rather proud of.</li>","retrieved":1635399731357},{"contents":"<li>Made a special CSS skin for the conlangs section of the site, and prettied up the listings.</li>\n    <li>Added a few new 88x31 buttons.</li>\n    <li>Changed the main site title. It's been a long time coming, but I just felt weird keeping Homestuck, specifically, in the title, when it's not the only fandom I'm in, and might not be as big for me, say, a few years from now. Plus... *gestures to Hussie and What Pumpkin's legal shenanigans* (not that I would be any better off, given I'm literally hosting a <i>Jade Harley Fanpage</i> and using a Xamag Skaia edit for my background, but like. At least the rest of the site isn't instantly Homestuckified by association.)</li>","retrieved":1635399731357},{"contents":"<li>Finished test directory revamp.</li><li>Added a <a href=\"/misc/3col_2/test1.html\">new style</a> -- a three column layout that uses multiple skins for optional styling.</li>","retrieved":1635399731357},{"contents":"<li>Revamped the test directory again, now with descriptions for individual styles.</li>","retrieved":1635399731357},{"contents":"<li>Modified Jade Pages CSS slightly (new button style, border around profile pic)</li><li>Added some #id links in the sidebar of Jade Pages music and gallery pages.</li>\n    <li>Linked to Spriter's Resource for Pesterquest Jade sprites</li>\n    <li>Cleaned up/deleted some miscellanous orphaned pages and files.</li>","retrieved":1635399731357},{"contents":"<li>Optimized the background PNG image to help reduce image loading time, and slightly reduced the color overlay in the site CSS.</li>","retrieved":1635399731357},{"contents":"<li>Fixed up Naūkeman glosses and ipa/pronunciation reference a bit.</li>","retrieved":1635399731357},{"contents":"<li>Added a sitemap, since that was probably long overdue.</li>\n    <li>Further cleanup, moved other old CSS test pages to a devoted directory.</li>\n    <li>Added a bit to Ewa Sio and Satecaan conlangs.</li>","retrieved":1635399731357},{"contents":"<li>Moved all link buttons to a devoted folder.</li>\n    <li>Did some long-needed cleanup and moved old versions of site pages to a 'version history' folder, complete with a directory page under the Miscellanous section of the site.</li>\n    <li>Experimented a bit with CSS and iframes to embed Twine stories in the main site style. It's a bit janky, though, since removing the margins cuts off the Twine sidebar, but I have yet to find a way around this. :(</li>","retrieved":1635399731357},{"contents":"<li>Got bored, made a quick-and-dirty copy of the main site in a folder with different CSS and layout. It has now been established as a joke \"subsite\" and linked in the Fun Stuff Directory. Further future recursion may follow.</li>","retrieved":1635399731358},{"contents":"<li>Updated the links page.</li>\n    <li>Added <a href=\"/imgcreds.html#misc\">something</a> special to the credits page.</li>","retrieved":1635399731360},{"contents":"<li>Miscellanous edits to various pages.</li>\n    <li>Updated About page slightly.</li>","retrieved":1635399731361},{"contents":"<li>Revamped the <a href=\"/testdirectory.html\">CSS testing</a> page. Stylesheets are now in categorized into templates I actually would like to be credited for, and old stylesheets I don't care about as much, or don't recommend. Two styles were also removed.</li>","retrieved":1635399731362},{"contents":"<li>Put the Skaia Xamag background back into the site style, with CSS gradient filter for some nice color effects.</li>","retrieved":1635399731363},{"contents":"<li>Added some Alternian vocabulary, plus a few new translations, both on the main page and in the font test.</li>","retrieved":1635399731364},{"contents":"<li>Worked on Alternian some more.</li>","retrieved":1635399731365},{"contents":"<li>Added a little more fluff to the about page.</li>\n    <li>Fixed a link on the 'other sites' page (congrats on the new site design, @iosion!)</li>\n    <li>It has been literally months since I removed the Homestuck background from my main CSS, but it's still there on my site icon on Neocities and I have no idea why.</li>\n    <li>Slightly edited/improved the tutorial for Webcomic CSS 2.0, and fixed some minor annoyances in the CSS.</li>","retrieved":1635399731367},{"contents":"<li>Improved some skins for subsections of the site.</li>\n    <li>Changed a few backgrounds on the CSS test pages so I could delete some large images I wasn't making much use of. This made ~10 MB difference, so I'm quite pleased.</li>\n    <li>Added one of the pesterquest end cards to the Jade Pages gallery.</li>","retrieved":1635399731372},{"contents":"<li>Misc. alterations, typo fixes, etc.</li>","retrieved":1635399731373},{"contents":"<li>Changed the site font, because the current one was making everything display really weirdly on certain devices, and it was screwing with my ability to properly design pages.</li>","retrieved":1635399731373},{"contents":"<li>Added some more Alternian.</li><li>Added Ewa Sio to the conlangs directory page.</li>","retrieved":1635399731374},{"contents":"<li>Happy New Year!</li>","retrieved":1635399731375},{"contents":"<li>Added new button links (hi beanbottles! a fellow Hollow Knight fan!)</li>\n    <li>Toyed around with a larger general fanfiction section in addition to the Jade Harley fic, like a sort of hand-coded personal archive.</li>","retrieved":1635399731375},{"contents":"<li>Changed the Homestuck background art of the standard page CSS to a gradient of the same colors. I just felt a little weird having official art as my primary site background, I guess? Like, it always felt a little weird copyright-wise, I guess. On the Jade page it's clear, but on the rest of the site... IDK. I might change it back, but I think it's worth keeping it like this for now. Maybe I'll make my own background art at some point later.</li>\n    <li>Added the start of yet another <i>fucking</i> conlang, because my impulse control here is... well, I'd say it's 0, but you guys have no idea how many I've been holding back, lol.</li>","retrieved":1635399731376},{"contents":"<li>Added a few more button links, and fixed some miscellanous typos.</li>","retrieved":1635399731377},{"contents":"<li>Skimmed Homestuck^2 to update the Jade Pages Gallery with some new art.</li>\n    <li>Webcomic CSS 2.0 is now listed in the testpage directory.</li>","retrieved":1635399731378},{"contents":"<li>Did some more work on my Webcomic 2.0 stylesheet, and spruced it up a bit (and also got rid of that awful peach color scheme.)</li>","retrieved":1635399731379},{"contents":"<li>Added some more words and grammar to Naūkeman</li>","retrieved":1635399731380},{"contents":"<li>Created two new (Hiveswap) Alternian <a href=\"/conlangs/alternian_font_test.html\">fonts</a> to play around with!</li>","retrieved":1635399731381},{"contents":"<li>Made an attempt at another webcomic format, this time with more thought put into how the updates would work.</li>\n    <li>Added a little to Sataca'an.</li>","retrieved":1635399731383},{"contents":"<li>Clawed free of the earth after a six week hiatus to work on conlangs (thank you so much Rivendell for cataloguing my Alternian conlang! I'm flattered :D)</li>\n    <li>Moved BLM links from the main page to the links page, with an addendum about timestamps of certain resources.</li>\n    <li>Added another banner to the button edits page.</li>","retrieved":1635399731384},{"contents":"<li>Added a new conlang.</li>","retrieved":1635399731391},{"contents":"<li>Added some <a href=\"/main.html#current\">important links</a> to the front page. (Please take a look!)</li>","retrieved":1635399731391},{"contents":"<li>Worked a bit on some conlangs. Fixed some stuff for Naūkeman, and added more verbs to Alternian.</li>","retrieved":1635399731392},{"contents":"<li>Happy Homestuck day, everyone!</li>\n    <li>Added more to Alternian (vocab, verb conjugation, some notes, etc.)</li>\n    <li>Bit the bullet and added some HS^2 art to the Jade Gallery, as well as acknowleding it on the main page. <ul><li> (Listen... they have some Good Jades. The work itself isn't my cuppa tea for the most part, but the art is great, and I like their Jade so far.)</li></ul></li>","retrieved":1635399731393},{"contents":"<li>Added more to Alternian, including an extra element to word entries to show the actual spelling in English letters for those who don't want to actually spend all their time deciphering Alternian glyphs (read: my lazy ass.)</li>","retrieved":1635399731407},{"contents":"<li>Added more content to Alternian.</li>","retrieved":1635399731408},{"contents":"<li>Added edits/buttons page, and updated links</li>\n    <li>Added some IPA to Naūkeman.</li>","retrieved":1635399731409},{"contents":"<li>Added a new CSS style.</li>","retrieved":1635399731409},{"contents":"<li>Started putting together a page for Alternian! <i>were doing this... were making in HAPEN</i></li>\n      <li>Added music page, misc page, updated the Jade Gallery with some album art</li>","retrieved":1635399731410},{"contents":"<li>Added several new images to the Jade Pages gallery</li>\n      <li>Gallery page now uses new CSS! (It has a new sidebar picture, too.)</li>","retrieved":1635399731411},{"contents":"<li>Began making CSS for a frankly ill-advised idea of a conlang version of Alternian.</li>","retrieved":1635399731411},{"contents":"<li>Added <a href=\"/other/more/r_test.html\">two</a> <a href=\"/other/more/tglow.html\">styles</a> to the test directory</li>\n      <li>Changed over meta/fic/etc index pages of Jade Pages to new CSS.</li>\n      <li>Revamped pesterlog CSS with custom styles for each different devices! <ul><li>(Seriously I'm so fucking happy with my LOHAC/iShades style hhh)</li></ul></li>","retrieved":1635399731412},{"contents":"<li>Welcome to the first major update of the 2020's! And uh. Happy new year's? I completely forgot to post anything about that, whoops.</li>\n    <li>Changed most of the remaining site pages to new CSS (links page, filk section), and made a minor fix to get the new CSS to play nice with the lyric tags.</li>\n    <li>Made some minor adjustments to the Jade Pages index and CSS. Several pages (i.e. the two meta pages) have been converted to the new style.</li>\n    <li>Started a to-do list.</li>\n    <li>Working on a new CSS style.</li>","retrieved":1635399731412},{"contents":"<li>Changed the landing page to use the new CSS!</li>\n    <li>Been working on <a href=\"/conlangs/naukeman.html\">Naūkeman</a>! I've got way more words than I did starting out, some <a href=\"/conlangs/naukeman.html#grammar\">grammar and syntax</a>, and even some sample sentences in there! Pinning down the grammar a little better definitely made a difference.</li>","retrieved":1635399731413},{"contents":"<li>Testing the new mobile-friendly CSS with some other important pages, including the changelog. (See below.)</li>\n    <li>Changed the main page of the Jade Pages to use the new CSS! After some deliberation, I decided to keep the original darker green color scheme. The change of font makes the whole things much more readable. The old version can be viewed <a href=\"/jadepages/old_index.html\">here</a>.</li>\n    <li>Replaced the changelog with a new version using the mobile-friendly CSS to avoid having to update two changelogs at the same time, much like last time I changed over. The old changelog can now be found <a href=\"/oldlog2.html\">here</a>.</li>","retrieved":1635399731413},{"contents":"<li>Worked some more on the mobile-friendly CSS. It seems to be functional, now, and the revised code works much nicer in other areas as well! :)</li>\n    <li>Changed the 404 Not Found page. It also now uses the new CSS.</li>","retrieved":1635399731414},{"contents":"<li>Happy birthday, Jade.</li>\n    <li>Worked a little more on the new Jade Pages CSS, and used it for a meta entry. How's it look?</li>","retrieved":1635399731414},{"contents":"<li>Working on a mobile-friendly new version of the site CSS. Made some test pages, including possibly a new <a href=\"/other/v3main_dummy.html\">main page</a> to use later. I'll be sad to see the sidebar go, but I think the new header links look pretty neat!</li>","retrieved":1635399731415},{"contents":"<li>Minor edits to credits page, and added credits for the pixel gifs on the test pages to help clear up any confusion regarding their sources.</li>","retrieved":1635399731415},{"contents":"<li>Added <a href=\"/misc/headeropacitytest.html\">another CSS style</a>.</li>","retrieved":1635399731416},{"contents":"<li>Updated changelog, at least a week late.</li>\n    <li>Edited links page. How the frickety-frackety did I manage to misspell <i>districts</i>?</li>","retrieved":1635399731417},{"contents":"<li>Made some updates, added a new CSS style to the test directory, made a test Jade Page with the new CSS (in its own little folder, of course!), and promptly forgot to update the changelog for a week.</li>","retrieved":1635399731417},{"contents":"<li>Began working on a mobile-friendly update of the main site CSS. It hasn't been implemented yet, but test pages can be found <a href=\"/other/mobilefriendlytest.html\">here</a> and <a href=\"/other/mobilefriendlyindex.html\">here</a>.</li>","retrieved":1635399731422},{"contents":"<li> (Dramatic announcer voice) <a href=\"/jadepages/code/jadetest1.html\">It works... for MOBILE!</a></li>\n    <li>Pesterquest assets! I have tentatively replaced the old Skaia background with a newer, nicer-looking image from John's route! :O</li>\n    <li>Edit: made a tinted version of the image that fits better with the site color scheme.</li>","retrieved":1635399731423},{"contents":"<li>Added some new vocabulary and grammar to <a href=\"/conlangs/naukeman.html\">Naūkeman</a>, and cleaned up the page a bit.</li>\n    <li>Did some more work on the possible replacement/new CSS for the Jade Pages.</li>","retrieved":1635399731423},{"contents":"<li>Added some new content to conlangs.</li>\n    <li>Added new CSS style, and used Jade Pages content to show off the features (well, feature.) Might revamp Jade Pages with it later on, since the old sidebar code is a mess..</li>","retrieved":1635399731424},{"contents":"<li>Made a new CSS style, vaguely inspired by another site I saw a while back that I thought looked cool.</li>\n    <li>Made mental note to revamp Jade CSS eventually, because the sidebar is a mess.</li>","retrieved":1635399731425},{"contents":"<li>20,000 views! :O</li>","retrieved":1635399731426},{"contents":"<li>Added to conlangs.</li>","retrieved":1635399731427},{"contents":"<li>Minor text edits, fixed a missing link.</li>\n    <li>Considered trying to make a guestbook. It'll go on the 'possible to-do' list, which I just made up right now.</li>","retrieved":1635399731427},{"contents":"<li>Added two semi-original songs to Filk page.</li>","retrieved":1635399731428},{"contents":"<li>Filled out some more of the conlang <a href=\"/conlangs/naukeman.html\">naūkeman</a>, and tweaked the vocab css.</li>","retrieved":1635399731428},{"contents":"<li>Added a <a href=\"/games/Caves.html\">new Twine game</a> to the games section. Warnings for major character death, body horror, unhappy endings, and general creepiness. Also, amateur writing. Proceed at your own risk.</li>","retrieved":1635399731429},{"contents":"<li>Made slight edits to 'So, about that epilogue...'</li>","retrieved":1635399731430},{"contents":"<li>Expanded Jade gallery, and switched the images for the 'fic' and 'meta' sections.</li>","retrieved":1635399731431},{"contents":"<li>Added images to the canon section of the Jade \"gallery\" page. Partly updated image credits to go with this.</li>\n    <li>Removed bigbox/boxlist/smallbox classes from the current Jade CSS, since it was kinda useless and taking up space. Pages using them have been edited accordingly.</li>\n    <li>Changed credits page to use new CSS, because somehow I forgot to put it in the sidebar and missed it as a result. The link will be added to the Links page.</li>","retrieved":1635399731432},{"contents":"<li>Added 'gallery' page to Jade Pages. Gave it a sidebar image, and put two sections, canon and fanart.</li>","retrieved":1635399731432},{"contents":"<li>Added a new style to the testpage directory.</li>\n    <li>Tested uploading of Twine games. It works, so that's something.</li>","retrieved":1635399731433},{"contents":"<li>Changed CSS of testpage directory to new style. The old page can be found <a href=\"/oldtestdir.html\">here</a>.</li>\n    <li>Made and added two new sample styles.</li>\n    <li>A few minor text edits.</li>","retrieved":1635399731434},{"contents":"<li>Created a 'Miscellaneous' link in the sidebar for stuff I add later. Added an about page.</li>","retrieved":1635399731438},{"contents":"<li>Modified the new CSS to adapt to viewport size! Hopefully it's a bit more mobile-friendly now, as it handles as narrow as 640px. Still a little wonky, but maybe functional.</li>","retrieved":1635399731438},{"contents":"<li>Main page and this log are now using the new CSS! The old versions of the main page and log (v2) can be found <a href=\"/oldmain2.html\">here</a> and <a href=\"/oldlog.html\">here</a>.</li>\n    <li>Fixed simple.css to adapt to window/screen size without changing box size.</li>","retrieved":1635399731439},{"contents":"<li>Added more tests of new CSS, made various minor edits.</li>\n    <li>Added two songs to the new \"Filk\" section (not linked on current main page.)</li>","retrieved":1635399731440},{"contents":"<li>Added some vocab to conlang #1, expanded and modified CSS to be more functional and better formatted.</li>\n    <li>Made default site text size a little smaller. It looks nicer that way.</li>\n    <li>Other miscellanous small changes.</li>\n    <li>Considering revamping site CSS completely. Same colors/image, but very different layout. <a href=\"/newtest.html\">Prototype</a> is WIP, but this page currently uses it.</li>","retrieved":1635399731440},{"contents":"<li>Added some stuff to the conlang page, made various minor text edits. Deleted a few unused images that were taking up space.</li>","retrieved":1635399731441},{"contents":"<li>??</li>\n    <li>Updated some credits stuff.</li>\n    <li>Moved 10,000 views gif to bottom of main page.</li>","retrieved":1635399731441},{"contents":"<li>Added another link to the links page.</li>\n    <li>10k views!!!</li>","retrieved":1635399731442},{"contents":"<li>Some minor text edits on various pages.</li>\n    <li>Added a button to link to this site on the 'links' page!</li>","retrieved":1635399731443},{"contents":"<li>Modified CSS for main pages to be <em>slightly </em>more mobile friendly. This has made message boxes and normal boxes mutually exclusive, though, so message boxes have been removed from the test page until they have one of their own.</li>","retrieved":1635399731444},{"contents":"<li>Deleted link to blog section for now.</li>\n    <li>Added 'conlang' section, for potential future use.</li>\n    <li>Fixed some minor typos, and changed text in one place.</li>\n    <li>Redesigned links page with columns and boxes, added a new link.</li>","retrieved":1635399731446},{"contents":"<li>Added nonsense/blog(?) section. Might delete later.</li>","retrieved":1635399731447},{"contents":"<li>Redesigned 404 page using a message box and some advice</li>\n    <li>Fixed some miscellaneous typos.</li>","retrieved":1635399731448},{"contents":"<li>Changed the background and colors of main CSS! It's Skaia now :)</li>\n    <li>A backup of the old version can be found <a href=\"/oldmain.html\">here</a>!</li>\n    <li>The old landing page look can be also seen <a href=\"/oldindex.html\">here</a>!</li>","retrieved":1635399731449},{"contents":"<li>Added meta: \"So, about that epilogue...\"</li>\n    <li>Slightly changed Jade CSS (confined sidebar text and links to box, added new button type that's much neater.)</li>\n    <li>Changed Jade page to use new button types.</li>","retrieved":1635399731450},{"contents":"<li>It sure is sad that Hussie never gave us a canon update on Homestuck's tenth anniversary and left the story as it was in [S] Credits in 2016, huh?</li>\n    <li>Added a \"meta\" section. </li>","retrieved":1635399731455},{"contents":"<li>Changed CSS for fic pages (bigger font, dark text on light background) and turned the sidebar gif into a still image since it was too distracting; added pesterlog CSS for future use.</li>","retrieved":1635399731456},{"contents":"<li>Added \"fic\" section to Jade Pages (no content yet.) Used tadpole image and updated credits accordingly.</li>\n        <li>Added links for Jade images on credits page.</li>\n        <li>Fixed main CSS so the message boxes don't look weird at certain sizes. Expanded main style test page and put some main page content in boxes.</li>","retrieved":1635399731457},{"contents":"<li>Commented out goodies link until I actually have anything worth sharing.</li>\n        <li>Revamped the Jade CSS, added a sidebar and changed the profile image and link, added some alt text.</li>","retrieved":1635399731457},{"contents":"<li>Moved Cool Sites page, gave other/index.html a list of links instead. WIP.</li>\n        <li>Changed colors of Jade CSS to not use generic \"green\". Should probably find a panel to reference.</li>","retrieved":1635399731458},{"contents":"<li>Added two-column button style to main CSS, implemented for Test Directory</li>","retrieved":1635399731459},{"contents":"<li>Redesigned main page a little with buttons and borders</li>","retrieved":1635399731460},{"contents":"<li>Expanded Jade Page (added disclaimer, added header bar, turned links into buttons, created profile)</li>","retrieved":1635399731461},{"contents":"<li>Added landing page, moved main page from \"index.html\" to \"main.html\"</li>","retrieved":1635399731462},{"contents":"<li>Miscallenous CSS Testing, site gets fleshed out a bit</li>","retrieved":1635399731463},{"contents":"<li>Site Established</li>","retrieved":1635399731465}]}